app/controllers/user_controller.rb

INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "test"], ["email", "test"], ["bio", "test"], ["created_at", "2018-10-30 14:12:21.317162"], ["updated_at", "2018-10-30 14:12:21.317162"]]
---
  def create
  	@user = User.new
  	@user.username = params["username"]
  	@user.email = params["email"]
	@user.bio = params["bio"]
  	@user.save